""" Задание 6
Напишите функцию, которая считает количество
цифр в числе. Число передаётся в качестве параметра. Из
функции нужно вернуть полученное количество цифр.
Например, если передали 3456, количество цифр будет 4.
 """


def number_of_digits(my_number):
    my_number = str(my_number)
    return print(len(my_number))
