""" Задание 5. Напишите функцию, которая получает два списка в качестве параметра и возвращает список, содержащий
элементы обоих списков. """

def get_general_list(list_one, list_two):
    list_three = list_one + list_two
    return print(list_three)
