def task_one():
    '''Задание 1
    Написать в словесной форме и нарисовать блок-схему
    алгоритма управления автомобилем.'''

    print('\nЗАДАНИЕ 1\n')
    print("Блок-схема алгоритма управления автомобилем\n")
    print("Начало")
    print("1. Включить зажигание")
    print("2. Застегнуть ремень безопасности")
    print("3. Нажать педаль газа")
    print("4. Ехать по маршруту")
    print("5. Нажать педаль тормоза")
    print("6. Снять ремень безопасности")
    print("7. Выключить двигатель")
    print("Конец\n")

    print(8 * " " + "_" + 29 * "-" + "_")
    print(7 * " " + "|" + "_" + 11 * " " + "Начало" + 12 * " " + "_" + "|")
    print(9 * " " + 29 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Включить зажигание             " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Застегнуть ремень безопасности " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Нажать педаль газа             " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Ехать по маршруту              " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Нажать педаль тормоза          " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Снять ремень безопасности      " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Выключить двигатель            " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(8 * " " + "_" + 29 * "-" + "_")
    print(7 * " " + "|" + "_" + 11 * " " + "Конец " + 12 * " " + "_" + "|")
    print(9 * " " + 29 * "-")

    '''Задание 2
    Написать в словесной форме и нарисовать блок-схему
    алгоритма покупки велосипедных шин.'''


def task_two():
    print('\nЗАДАНИЕ 2\n')
    print("Блок-схема алгоритма покупки велосипедных шин")
    print("Начало")
    print("1. Определить требуемые характеристики шин")
    print("2. Найти магазины, где можно купить шины")
    print("3. Сравнить предложения, выбрать шины по цене и качеству")
    print("4. Проверить наличие выбранных шин в магазине")
    print("5. Если шины есть в наличии, купить шины")
    print("6. Если шин нет в наличии, заказать шины")
    print("Конец\n")

    print(8 * " " + "_" + 18 * "-" + "_")
    print(7 * " " + "|" + "_" + 6 * " " + "Начало" + 6 * " " + "_" + "|")
    print(9 * " " + 18 * "-")
    print(17 * " " + "↓")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(7 * " " + "|" + "Определить требуемые" + "|")
    print(7 * " " + "|" + "характеристики шин  " + "|")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(17 * " " + "↓")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(7 * " " + "|" + "Найти магазины, где " + "|")
    print(7 * " " + "|" + "можно купить шины   " + "|")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(17 * " " + "↓")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(7 * " " + "|" + "Сравнить и выбрать  " + "|")
    print(7 * " " + "|" + "оптимальные шины    " + "|")
    print(7 * " " + "|" + "по цене и качеству  " + "|")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(17 * " " + "↓")
    print(16 * " " + "_-_")
    print(13 * " " + 3 * "-" + 3 * " " + 3 * "-")
    print(8 * " " + 5 * "-" + 9 * " " + 5 * "-" + 5 * " " + "нет" + 2 * " " + 22 * "-" + 7 * " ")
    print(7 * " " + "|" + "   Если шины есть   " + "|" + "-------→" + "|" + "   Заказать шины    " + "|")
    print(8 * " " + 5 * "-" + 9 * " " + 5 * "-" + 10 * " " + 22 * "-")
    print(13 * " " + 3 * "-" + 3 * " " + 3 * "-" + 25 * " " + "|")
    print(16 * " " + "-_-" + 28 * " " + "|")
    print(17 * " " + "↓" + " да" + 26 * " " + "|")
    print(7 * " " + 22 * "-" + 18 * " " + "|")
    print(7 * " " + "|" + "    Купить шины     " + "|" + 18 * " " + "|")
    print(7 * " " + 22 * "-" + 18 * " " + "|")
    print(17 * " " + "↓" + 29 * " " + "|")
    print(8 * " " + "_" + 18 * "-" + "_" + 19 * " " + "|")
    print(7 * " " + "|" + "_" + 6 * " " + "Конец " + 6 * " " + "_" + "|" + "←" + 17 * "-")
    print(9 * " " + 18 * "-" + 8 * " ")

    '''Задание 3
    Написать в словесной форме и нарисовать блок-схему
    алгоритма написания романа.'''


def task_three():
    print('\nЗАДАНИЕ 3\n')
    print("Блок-схема алгоритма написания романа")
    print("Начало")
    print("1. Придумать идею")
    print("2. Разработать план романа")
    print("3. Написать черновик")
    print("4. Написать 1 главу")
    print("5. Написать 2 главу")
    print("6. Написать 3 главу")
    print("7. Добавить иллюстрации")
    print("Конец\n")

    print(8 * " " + "_" + 18 * "-" + "_")
    print(7 * " " + "|" + "_" + 6 * " " + "Начало" + 6 * " " + "_" + "|")
    print(9 * " " + 18 * "-")
    print(17 * " " + "↓")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(7 * " " + "|" + "Придумать идею      " + "|")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(17 * " " + "↓")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(7 * " " + "|" + "Разработать план    " + "|")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(17 * " " + "↓")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(7 * " " + "|" + "Написать черновик   " + "|")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(17 * " " + "↓")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(7 * " " + "|" + "Написать 1 главу    " + "|")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(17 * " " + "↓")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(7 * " " + "|" + "Написать 2 главу    " + "|")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(17 * " " + "↓")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(7 * " " + "|" + "Написать 3 главу    " + "|")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(17 * " " + "↓")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(7 * " " + "|" + "Добавить иллюстрации" + "|")
    print(7 * " " + 22 * "-" + 7 * " ")
    print(17 * " " + "↓")
    print(8 * " " + "_" + 18 * "-" + "_")
    print(7 * " " + "|" + "_" + 6 * " " + "Конец " + 6 * " " + "_" + "|")
    print(9 * " " + 18 * "-")

    '''Задание 4
    Написать в словесной форме и нарисовать блок-схему
    алгоритма установки дверей.'''


def task_four():
    print('\nЗАДАНИЕ 4\n')
    print("Блок-схема алгоритма установки дверей")
    print("Начало")
    print("1. Подготовить дверной проём")
    print("2. Собрать дверную коробку")
    print("3. Установить петли")
    print("4. Монтаж дверной коробки в проём")
    print("5. Навесить дверное полотно")
    print("6. Установить доборы")
    print("7. Установить наличники")
    print("8. Поставить фурнитуру")
    print("Конец\n")

    print(8 * " " + "_" + 29 * "-" + "_")
    print(7 * " " + "|" + "_" + 11 * " " + "Начало" + 12 * " " + "_" + "|")
    print(9 * " " + 29 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Подготовить дверной проём      " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Собрать дверную коробку        " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Установить петли               " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Монтаж дверной коробки в проём " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Навесить дверное полотно       " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Установить доборы              " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "Установить наличники           " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 33 * "-")
    print(7 * " " + "|" + "ПОставить фурнитуру            " + "|")
    print(7 * " " + 33 * "-")
    print(23 * " " + "↓")
    print(8 * " " + "_" + 29 * "-" + "_")
    print(7 * " " + "|" + "_" + 11 * " " + "Конец " + 12 * " " + "_" + "|")
    print(9 * " " + 29 * "-")

    '''Задание 5
    Написать в словесной форме и нарисовать блок-схему
    алгоритма управления скейтом.'''


def task_five():
    print('\nЗАДАНИЕ 5\n')
    print("Блок-схема алгоритма управления скейтом")
    print("Начало")
    print("1. Поставить ногу на скейт")
    print("2. Оттолкнуться другой ногой")
    print("3. Поставить вторую ногу на скейт")
    print("4. Переместить вес, чтобы повернуть")
    print("5. Опустить ногу на землю")
    print("6. Остановиться")
    print("Конец\n")

    print(8 * " " + "_" + 30 * "-" + "_")
    print(7 * " " + "|" + "_" + 11 * " " + "Начало" + 13 * " " + "_" + "|")
    print(9 * " " + 30 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 34 * "-")
    print(7 * " " + "|" + "Поставить ногу на скейт         " + "|")
    print(7 * " " + 34 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 34 * "-")
    print(7 * " " + "|" + "Оттолкнуться другой ногой       " + "|")
    print(7 * " " + 34 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 34 * "-")
    print(7 * " " + "|" + "Поставить вторую ногу на скейт  " + "|")
    print(7 * " " + 34 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 34 * "-")
    print(7 * " " + "|" + "Переместить вес, чтобы повернуть" + "|")
    print(7 * " " + 34 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 34 * "-")
    print(7 * " " + "|" + "Опустить ногу на землю          " + "|")
    print(7 * " " + 34 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 34 * "-")
    print(7 * " " + "|" + "Остановиться                    " + "|")
    print(7 * " " + 34 * "-")
    print(23 * " " + "↓")
    print(8 * " " + "_" + 30 * "-" + "_")
    print(7 * " " + "|" + "_" + 11 * " " + "Конец " + 13 * " " + "_" + "|")
    print(9 * " " + 30 * "-")

    '''Задание 6
    Написать в словесной форме и нарисовать блок-схему
    алгоритма мытья посуды.'''


def task_six():
    # Задание 6
    print('\nЗАДАНИЕ 6\n')
    print("Блок-схема алгоритма мытья посуды")
    print("Начало")
    print("1 Включить воду")
    print("2 Взять губку")
    print("3 Нанести на губку моющее средство")
    print("4. Делать, пока не закончится вся посуда:")
    print("4.1. Взять посудину")
    print("4.2. Вымыть посудину")
    print("4.3 Поставить сушиться")
    print("5. Положить губку на место")
    print("6. Закрыть кран")
    print("Конец\n")

    print(8 * " " + "_" + 30 * "-" + "_")
    print(7 * " " + "|" + "_" + 11 * " " + "Начало" + 13 * " " + "_" + "|")
    print(9 * " " + 30 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 34 * "-")
    print(7 * " " + "|" + "Включить воду                   " + "|")
    print(7 * " " + 34 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 34 * "-")
    print(7 * " " + "|" + "Взять губку                     " + "|")
    print(7 * " " + 34 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 34 * "-")
    print(7 * " " + "|" + "Нанести на губку моющее средство" + "|")
    print(7 * " " + 34 * "-")
    print(23 * " " + "|" + "←" + 22 * "-")
    print(23 * " " + "↓" + 23 * " " + "|")
    print(7 * " " + 34 * "-" + 6 * " " + "|")
    print(7 * " " + "|" + "Взять посудину                  " + "|" + 6 * " " + "|")
    print(7 * " " + 34 * "-" + 6 * " " + "|")
    print(23 * " " + "↓" + 23 * " " + "|")
    print(7 * " " + 34 * "-" + 6 * " " + "|")
    print(7 * " " + "|" + "Вымыть посудину                 " + "|" + 6 * " " + "|")
    print(7 * " " + 34 * "-" + 6 * " " + "|")
    print(23 * " " + "↓" + 23 * " " + "|")
    print(7 * " " + 34 * "-" + 6 * " " + "|")
    print(7 * " " + "|" + "Поставить сушится               " + "|" + 6 * " " + "|")
    print(7 * " " + 34 * "-" + 6 * " " + "|")
    print(23 * " " + "↓" + 23 * " " + "|")
    print(21 * " " + "__-__" + 21 * " " + "|")
    print(15 * " " + "___---" + 5 * " " + "---___" + 15 * " " + "|")
    print(8 * " " + "___---" + 19 * " " + "---___" + 3 * " " + "нет" + 2 * " " + "|")
    print(7 * " " + "|" + "   Если посуда закончилась     " + "|" + "-------")
    print(8 * " " + "---___" + 19 * " " + "___---")
    print(15 * " " + "---___" + 5 * " " + "___---")
    print(21 * " " + "--_--")
    print(23 * " " + "↓" + " да")
    print(7 * " " + 34 * "-")
    print(7 * " " + "|" + "Положить губку на место         " + "|")
    print(7 * " " + 34 * "-")
    print(23 * " " + "↓")
    print(7 * " " + 34 * "-")
    print(7 * " " + "|" + "Закрыть кран                    " + "|")
    print(7 * " " + 34 * "-")
    print(23 * " " + "↓")
    print(8 * " " + "_" + 30 * "-" + "_")
    print(7 * " " + "|" + "_" + 11 * " " + "Конец " + 13 * " " + "_" + "|")
    print(9 * " " + 30 * "-")


def task_selection():
    task_number = input('Введите номер задания от 1 до 6: ')
    task_number = str(task_number)
    if task_number == '1':
        task_one()
    elif task_number == '2':
        task_two()
    elif task_number == '3':
        task_three()
    elif task_number == '4':
        task_four()
    elif task_number == '5':
        task_five()
    elif task_number == '6':
        task_six()
    else:
        print('Неправильный номер операции ввидите от 1 до 6')


if __name__ == '__main__':
    task_selection()
